package org.example;

// 1.Реализовать программу, выводящую на экран результаты:
//Сложения двух чисел
//Вычитания двух чисел
//Умножения двух чисел
//Деления двух чисел
//Каждая из арифметических операций должна быть реализована как отдельный метод.

//import java.util.Scanner;
//
//public class Main {
//
//    public static void main(String[] args) {
//        Scanner scanner = new Scanner(System.in);
//
//        System.out.print("Ввести первое число: ");
//        int number1 = scanner.nextInt();
//
//        System.out.print("Ввести второе число: ");
//        int number2 = scanner.nextInt();
//
//        System.out.println("Сложение: " + add(number1, number2));
//        System.out.println("Вычитание: " + subtract(number1, number2));
//        System.out.println("Умножение: " + multiply(number1, number2));
//
//        if (number2 != 0) {
//            System.out.println("Деление: " + divide(number1, number2));
//        } else {
//            System.out.println("Делить на ноль невозможно.");
//        }
//    }
//
//    public static int add(int number1, int number2) {
//        return number1 + number2;
//    }
//
//    public static int subtract(int number1, int number2) {
//        return number1 - number2;
//    }
//
//    public static int multiply(int number1, int number2) {
//        return number1 * number2;
//    }
//
//    public static double divide(int number1, int number2) {
//        return (double)number1 / number2;
//    }
//}


//2. Напишите класс Converter для конвертации из градусов по Цельсию в Кельвины​, ​Фаренгейты:
//У класса должны быть методы для конвертации.
//Реализуйте два метода в классе:
//runKelvinConverter(double baseValue)
//runFahrenheitConverter(double baseValue)


 // 3.Напишите программу на Java для того, чтобы поменять местами значения, хранящиеся в двух переменных с помощью третьей переменной:
//
//
//На вход: а = 2; b = 5;
//На выход: a = 5; b = 2;
//Используйте переменную temp;

//public class Main {
//    public static void main(String[] args) {
//        int a = 2;
//        int b = 5;
//        int temp;
//
//
//        System.out.println("Первоначальные значения:");
//        System.out.println("a = " + a);
//        System.out.println("b = " + b);
//
//       a = a + b;
//       b = a - b;
//       a = a - b;
//
//
//        System.out.println("Измененные значения:");
//        System.out.println("a = " + a);
//        System.out.println("b = " + b);
//    }
//}


